import { Injectable } from '@angular/core';
import { Teacher } from './models/teacher';
import { Observable } from 'rxjs';

@Injectable({
  providedIn: 'root',
})
export class TeachersService {
  teachers: Teacher[] = [
    new Teacher(
      'رضا مولایی',
      `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیازی تکنولوژی مورد نیازی است. `,
      'Molaii@gmile.com',
      '../../assets/images/person1.jpeg',
      87,
      ['برنامه نویسی وب', 'هک و امنیت'],
      7,
      'https://www.linkedin.com/in/jb-jeze-87g233',
      [],
      34
    ),
    new Teacher(
      'رحمان فضلی',
      `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیازی تکنولوژی مورد نیازی است. `,
      'Fazli@gmile.com',
      '../../assets/images/manAvt.png',
      83,
      ['برنامه نویسی اندروید', 'برنامه نویسی ios'],
      1,
      'https://www.linkedin.com/in/jb-jeze-87s8733',
      [],
      37
    ),
    new Teacher(
      'محمد رضایی',
      `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیازی تکنولوژی مورد نیازی است. `,
      'Rezaii@gmile.com',
      '../../assets/images/person2.png',
      91,
      ['طراحی UI/UX'],
      3,
      'https://www.linkedin.com/in/jb-jeze-87l968',
      [],
      46
    ),
    new Teacher(
      'جمال مرتضوی',
      `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیازی تکنولوژی مورد نیازی است. `,
      'Mortazavi@gmile.com',
      '../../assets/images/manAvt.png',
      84,
      ['سخت افزار'],
      4,
      'https://www.linkedin.com/in/jb-jeze-87p6541',
      [],
      31
    ),
    new Teacher(
      'سپیده میرزایی',
      `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیازی تکنولوژی مورد نیازی است. `,
      'Mirzaii@gmile.com',
      '../../assets/images/avtarfemale.jpg',
      91,
      ['هک وامنیت'],
      2,
      'https://www.linkedin.com/in/jb-jeze-87w88888',
      [],
      26
    ),
    new Teacher(
      'احمد خانی',
      `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیازی تکنولوژی مورد نیازی است. `,
      'Khani@gmile.com',
      '../../assets/images/person4.jpg',
      94,
      ['برنامه نویسی دسکتاپ', 'SEO'],
      5,
      'https://www.linkedin.com/in/jb-jeze-87w5111',
      [],
      51
    ),
    new Teacher(
      'فاطمه عزیزیان',
      `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیازی تکنولوژی مورد نیازی است. `,
      'Azizian@gmile.com',
      '../../assets/images/avtarfemale.jpg',
      87,
      ['آموزش ریاضیات'],
      5,
      '',
      [],
      57
    ),
    new Teacher(
      'علی هاشمی',
      `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیازی تکنولوژی مورد نیازی است. `,
      'Hashemi@gmile.com',
      '../../assets/images/person5.png',
      86,
      ['برنامه نویسی بک اند', 'دیتابیس'],
      7,
      'https://www.linkedin.com/in/jb-jeze-87s8733',
      [],
      42
    ),
    new Teacher(
      'رضا جمشیدی',
      `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیازی تکنولوژی مورد نیازی است. `,
      'Jamshidi@gmile.com',
      '../../assets/images/manAvt.png',
      81,
      ['ارز دیجیتال'],
      2,
      'https://www.linkedin.com/in/jb-jeze-87g4132',
      [],
      33
    ),
    new Teacher(
      'سبحان محمدی',
      `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیازی تکنولوژی مورد نیازی است. `,
      'Mohammadi@gmile.com',
      '../../assets/images/person3.jpeg',
      84,
      ['هک و امنیت'],
      4,
      'https://www.linkedin.com/in/jb-jeze-87e833',
      [],
      31
    ),
    new Teacher(
      'محسن ثابتی',
      `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیازی تکنولوژی مورد نیازی است. `,
      'Sabeti@gmile.com',
      '../../assets/images/manAvt.png',
      93,
      ['آموزش  فیزیک'],
      4,
      '',
      [],
      46
    ),
    new Teacher(
      'یاسمن ملکی',
      `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیازی تکنولوژی مورد نیازی است. `,
      'Maleki@gmile.com',
      '../../assets/images/avtarfemale.jpg',
      79,
      ['برنامه نویسی فرانت اند'],
      3,
      'https://www.linkedin.com/in/jb-jeze-87l46546',
      [],
      40
    ),
    new Teacher(
      'سارا عبیدی',
      `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیازی تکنولوژی مورد نیازی است. `,
      'Maleki@gmile.com',
      '../../assets/images/avtarfemale.jpg',
      83,
      ['طراحی UI/UX'],
      3,
      'https://www.linkedin.com/in/jb-jeze-87t8223',
      [],
      40
    ),
    new Teacher(
      'صالح قربانی',
      `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیازی تکنولوژی مورد نیازی است. `,
      'Ghorbani@gmile.com',
      '../../assets/images/manAvt.png',
      88,
      ['آموزش زبان خارجه'],
      2,
      '',
      [],
      38
    ),
  ];
  getAllTeachers() {
    return new Observable((sub) => {
      setTimeout(() => {
        sub.next(this.teachers);
      }, 2000);
    });
  } //for simulateing get data from data base for showing resolve route gaurd
}
